HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxFlash_bf.h
/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S4ROM */
#define IFX_FLASH_PROCONOTP_S4ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S4ROM */
#define IFX_FLASH_PROCONOTP_S4ROM_OFF (4)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S5ROM */
#define IFX_FLASH_PROCONOTP_S5ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S5ROM */
#define IFX_FLASH_PROCONOTP_S5ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S5ROM */
#define IFX_FLASH_PROCONOTP_S5ROM_OFF (5)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONOTP_S6ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONOTP_S6ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONOTP_S6ROM_OFF (6)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S7ROM */
#define IFX_FLASH_PROCONOTP_S7ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S7ROM */
#define IFX_FLASH_PROCONOTP_S7ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S7ROM */
#define IFX_FLASH_PROCONOTP_S7ROM_OFF (7)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S8ROM */
#define IFX_FLASH_PROCONOTP_S8ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S8ROM */
#define IFX_FLASH_PROCONOTP_S8ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S8ROM */
#define IFX_FLASH_PROCONOTP_S8ROM_OFF (8)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.S9ROM */
#define IFX_FLASH_PROCONOTP_S9ROM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S9ROM */
#define IFX_FLASH_PROCONOTP_S9ROM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S9ROM */
#define IFX_FLASH_PROCONOTP_S9ROM_OFF (9)

/** \\brief  Length for Ifx_FLASH_PROCONOTP_Bits.TP */
#define IFX_FLASH_PROCONOTP_TP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONOTP_Bits.TP */
#define IFX_FLASH_PROCONOTP_TP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONOTP_Bits.TP */
#define IFX_FLASH_PROCONOTP_TP_OFF (31)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.RPRO */
#define IFX_FLASH_PROCONP_RPRO_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.RPRO */
#define IFX_FLASH_PROCONP_RPRO_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.RPRO */
#define IFX_FLASH_PROCONP_RPRO_OFF (31)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S0L */
#define IFX_FLASH_PROCONP_S0L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S0L */
#define IFX_FLASH_PROCONP_S0L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S0L */
#define IFX_FLASH_PROCONP_S0L_OFF (0)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S10L */
#define IFX_FLASH_PROCONP_S10L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S10L */
#define IFX_FLASH_PROCONP_S10L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S10L */
#define IFX_FLASH_PROCONP_S10L_OFF (10)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S11L */
#define IFX_FLASH_PROCONP_S11L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S11L */
#define IFX_FLASH_PROCONP_S11L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S11L */
#define IFX_FLASH_PROCONP_S11L_OFF (11)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S12L */
#define IFX_FLASH_PROCONP_S12L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S12L */
#define IFX_FLASH_PROCONP_S12L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S12L */
#define IFX_FLASH_PROCONP_S12L_OFF (12)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S13L */
#define IFX_FLASH_PROCONP_S13L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S13L */
#define IFX_FLASH_PROCONP_S13L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S13L */
#define IFX_FLASH_PROCONP_S13L_OFF (13)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S14L */
#define IFX_FLASH_PROCONP_S14L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S14L */
#define IFX_FLASH_PROCONP_S14L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S14L */
#define IFX_FLASH_PROCONP_S14L_OFF (14)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S15L */
#define IFX_FLASH_PROCONP_S15L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S15L */
#define IFX_FLASH_PROCONP_S15L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S15L */
#define IFX_FLASH_PROCONP_S15L_OFF (15)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S16L */
#define IFX_FLASH_PROCONP_S16L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S16L */
#define IFX_FLASH_PROCONP_S16L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S16L */
#define IFX_FLASH_PROCONP_S16L_OFF (16)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S17L */
#define IFX_FLASH_PROCONP_S17L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S17L */
#define IFX_FLASH_PROCONP_S17L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S17L */
#define IFX_FLASH_PROCONP_S17L_OFF (17)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S18L */
#define IFX_FLASH_PROCONP_S18L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S18L */
#define IFX_FLASH_PROCONP_S18L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S18L */
#define IFX_FLASH_PROCONP_S18L_OFF (18)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S19L */
#define IFX_FLASH_PROCONP_S19L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S19L */
#define IFX_FLASH_PROCONP_S19L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S19L */
#define IFX_FLASH_PROCONP_S19L_OFF (19)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S1L */
#define IFX_FLASH_PROCONP_S1L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S1L */
#define IFX_FLASH_PROCONP_S1L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S1L */
#define IFX_FLASH_PROCONP_S1L_OFF (1)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S20L */
#define IFX_FLASH_PROCONP_S20L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S20L */
#define IFX_FLASH_PROCONP_S20L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S20L */
#define IFX_FLASH_PROCONP_S20L_OFF (20)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S21L */
#define IFX_FLASH_PROCONP_S21L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S21L */
#define IFX_FLASH_PROCONP_S21L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S21L */
#define IFX_FLASH_PROCONP_S21L_OFF (21)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S22L */
#define IFX_FLASH_PROCONP_S22L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S22L */
#define IFX_FLASH_PROCONP_S22L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S22L */
#define IFX_FLASH_PROCONP_S22L_OFF (22)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S23L */
#define IFX_FLASH_PROCONP_S23L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S23L */
#define IFX_FLASH_PROCONP_S23L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S23L */
#define IFX_FLASH_PROCONP_S23L_OFF (23)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S24L */
#define IFX_FLASH_PROCONP_S24L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S24L */
#define IFX_FLASH_PROCONP_S24L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S24L */
#define IFX_FLASH_PROCONP_S24L_OFF (24)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S25L */
#define IFX_FLASH_PROCONP_S25L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S25L */
#define IFX_FLASH_PROCONP_S25L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S25L */
#define IFX_FLASH_PROCONP_S25L_OFF (25)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S26L */
#define IFX_FLASH_PROCONP_S26L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S26L */
#define IFX_FLASH_PROCONP_S26L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S26L */
#define IFX_FLASH_PROCONP_S26L_OFF (26)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S2L */
#define IFX_FLASH_PROCONP_S2L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S2L */
#define IFX_FLASH_PROCONP_S2L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S2L */
#define IFX_FLASH_PROCONP_S2L_OFF (2)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S3L */
#define IFX_FLASH_PROCONP_S3L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S3L */
#define IFX_FLASH_PROCONP_S3L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S3L */
#define IFX_FLASH_PROCONP_S3L_OFF (3)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S4L */
#define IFX_FLASH_PROCONP_S4L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S4L */
#define IFX_FLASH_PROCONP_S4L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S4L */
#define IFX_FLASH_PROCONP_S4L_OFF (4)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S5L */
#define IFX_FLASH_PROCONP_S5L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S5L */
#define IFX_FLASH_PROCONP_S5L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S5L */
#define IFX_FLASH_PROCONP_S5L_OFF (5)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S6L */
#define IFX_FLASH_PROCONP_S6L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S6L */
#define IFX_FLASH_PROCONP_S6L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S6L */
#define IFX_FLASH_PROCONP_S6L_OFF (6)

/** \\brief  Length for Ifx_FLASH_PROCONP_Bits.S7L */
#define IFX_FLASH_PROCONP_S7L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCONP_Bits.S7L */
#define IFX_FLASH_PROCONP_S7L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCONP_Bits.S7L */
#define IFX_FLASH_PROCONP_S7L_OFF (7)

